{"cells":[{"metadata":{"trusted":true},"id":"c872b362","cell_type":"code","source":"# Parameters:\ntask = \"cut:Quartering\"\ntobject = \"obo:FOODON_03301710\"","execution_count":27,"outputs":[]},{"metadata":{},"id":"ddf7ad7b","cell_type":"markdown","source":"import rdflib for querying the knowledge graph for action parameters"},{"metadata":{"trusted":true},"id":"6d8d7dc4","cell_type":"code","source":"!pip install rdflib\n# import rdflib\nfrom rdflib import Graph, Literal, URIRef, Namespace\n# rdflib knows about quite a few popular namespaces, like W3C ontologies, schema.org etc\nfrom rdflib.namespace import OWL, RDF, RDFS","execution_count":2,"outputs":[{"output_type":"stream","text":"Collecting rdflib\n  Downloading rdflib-7.0.0-py3-none-any.whl (531 kB)\n\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m531.9/531.9 kB\u001b[0m \u001b[31m9.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n\u001b[?25hRequirement already satisfied: pyparsing<4,>=2.1.0 in /srv/conda/envs/notebook/lib/python3.10/site-packages (from rdflib) (3.0.9)\nCollecting isodate<0.7.0,>=0.6.0\n  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.7/41.7 kB\u001b[0m \u001b[31m10.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n\u001b[?25hRequirement already satisfied: six in /srv/conda/envs/notebook/lib/python3.10/site-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\nInstalling collected packages: isodate, rdflib\nSuccessfully installed isodate-0.6.1 rdflib-7.0.0\n","name":"stdout"}]},{"metadata":{},"id":"36786a7e","cell_type":"markdown","source":"# We can query for the toold to be used for the chosen task:"},{"metadata":{"trusted":true},"id":"60423fda","cell_type":"code","source":"g = Graph()\n\n# define prefixes to be used in the query \nSOMA = Namespace(\"http://www.ease-crc.org/ont/SOMA.owl#\")\nCUT2 = Namespace(\"http://www.ease-crc.org/ont/situation_awareness#\")\nCUT = Namespace(\"http://www.ease-crc.org/ont/food_cutting#\")\nDUL = Namespace(\"http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#\")\nOBO = Namespace(\"http://purl.obolibrary.org/obo/\")\ng.bind(\"owl\", OWL)\ng.bind(\"rdfs\", RDFS)\ng.bind(\"soma\", SOMA)\ng.bind(\"cut2\", CUT2)\ng.bind(\"cut\", CUT)\ng.bind(\"dul\", DUL)\ng.bind(\"obo\", OBO)\n\n# the actual query comes here\nquery = \"\"\"SELECT ?alltools WHERE {\n      SERVICE <https://api.krr.triply.cc/datasets/mkumpel/FruitCuttingKG/services/FoodCuttingKG/sparql> {\n      %s rdfs:subClassOf ?node.\n      ?node owl:onProperty soma:hasDisposition.\n      ?node owl:someValuesFrom ?collection.\n      ?collection owl:intersectionOf ?node2.\n      ?node2 rdf:first cut2:Cuttability.\n      ?node2 rdf:rest ?toolnode.\n      ?toolnode rdf:rest ?collection2.\n      ?collection2 rdf:first ?tooluse.\n      ?tooluse owl:onProperty soma:affordsTrigger.\n      ?tooluse owl:allValuesFrom ?tool.\n      ?tool owl:onProperty dul:classifies.\n      ?tool owl:allValuesFrom ?whattool.\n      ?alltools rdfs:subClassOf* ?whattool.} }\"\"\" % (tobject) # the input parameter for the query. For testing, you can remove % (tobject) here\n#and replace %s in the first line of the query with a variable like ?food to get all food and objects\n\nfor row in g.query(query):\n    print(row.alltools)","execution_count":4,"outputs":[{"output_type":"stream","text":"http://www.ease-crc.org/ont/SOMA.owl#CuttingTool\nhttp://www.ease-crc.org/ont/food_cutting#Knife\nhttp://www.ease-crc.org/ont/food_cutting#AppleCutter\nhttp://www.ease-crc.org/ont/food_cutting#ParingKnife\nhttp://www.ease-crc.org/ont/situation_awareness#BreadKnife\nhttp://www.ease-crc.org/ont/SOMA-HOME.owl#KitchenKnife\n","name":"stdout"}]},{"metadata":{},"id":"342181e1","cell_type":"markdown","source":"# The robot needs to know if prior actions need to be executed:"},{"metadata":{"trusted":true},"id":"f1e9f2be","cell_type":"code","source":"additionalactionquery = \"\"\"SELECT ?action WHERE {\n      SERVICE <https://api.krr.triply.cc/datasets/mkumpel/FruitCuttingKG/services/FoodCuttingKG/sparql> {  \n  %s rdfs:subClassOf ?restriction.\n  ?restriction owl:onProperty cut:hasPart.\n  ?restriction owl:someValuesFrom ?node.\n  ?node owl:intersectionOf ?intersec.\n  ?intersec rdf:first ?foodpart.\n  ?intersec rdf:rest ?node2.\n  ?node2 rdf:first ?part.\n  ?part owl:onProperty cut:hasEdibility.\n  {?part owl:someValuesFrom cut:ShouldBeAvoided.}\n  UNION\n  {?part owl:someValuesFrom cut:MustBeAvoided.}\n  ?foodpart rdfs:subClassOf ?partrestriction.\n  ?partrestriction owl:onProperty soma:hasDisposition.\n  ?partrestriction owl:someValuesFrom ?partnode.\n  ?partnode owl:intersectionOf ?intersection.\n  ?intersection rdf:first ?disposition.\n  ?intersection rdf:rest ?actionrestriction.\n  ?actionrestriction rdf:first ?actionnode.\n  ?actionnode owl:onProperty soma:affordsTask.\n  ?actionnode owl:someValuesFrom ?action.\n} }\"\"\" % (tobject) # the input parameter for the query. For testing, you can remove % (tobject) here\n#and replace %s in the first line of the query with a variable like ?food to get all food and objects\n\nfor row in g.query(additionalactionquery):\n    print(row.action)","execution_count":5,"outputs":[{"output_type":"stream","text":"http://www.ease-crc.org/ont/food_cutting#CoreScraping\nhttp://www.ease-crc.org/ont/food_cutting#CoreCutting\n","name":"stdout"}]},{"metadata":{"trusted":true},"id":"0c779c5e","cell_type":"code","source":"prioractionquery = \"\"\"  SELECT ?priortask WHERE {\n      SERVICE <https://api.krr.triply.cc/datasets/mkumpel/FruitCuttingKG/services/FoodCuttingKG/sparql> {  \n  %s rdfs:subClassOf ?sub.\n  ?sub owl:onProperty cut:requiresPriorTask .\n  ?sub owl:someValuesFrom ?priortask.\n} }\"\"\" % (task)\n\nfor row in g.query(prioractionquery):\n    print(row.priortask)","execution_count":10,"outputs":[{"output_type":"stream","text":"http://www.ease-crc.org/ont/food_cutting#Halving\n","name":"stdout"}]},{"metadata":{},"id":"cfaef957","cell_type":"markdown","source":"# The robot needs to also know the number of repetitions required for performing the task:"},{"metadata":{"trusted":true},"id":"748c8a0a","cell_type":"code","source":"repetitionsquery = \"\"\"  SELECT ?rep WHERE {\n      SERVICE <https://api.krr.triply.cc/datasets/mkumpel/FruitCuttingKG/services/FoodCuttingKG/sparql> {  \n  {\n     OPTIONAL{ %s rdfs:subClassOf ?action}\n        ?action rdfs:subClassOf* ?rep_node.\n        ?rep_node owl:onProperty cut:repetitions.\n        FILTER EXISTS {\n            ?rep_node owl:hasValue ?val.}\n        BIND(\"= 1\" AS ?rep)}\n    UNION\n    {\n       OPTIONAL{ %s rdfs:subClassOf ?action }\n        ?action rdfs:subClassOf* ?rep_node.\n        ?rep_node owl:onProperty cut:repetitions.\n        FILTER EXISTS {\n            ?rep_node owl:minQualifiedCardinality ?val.}\n        BIND(\"more than 1\" AS ?rep)}} }\"\"\" % (task, task)\n\nfor row in g.query(repetitionsquery):\n    print(row.rep)","execution_count":29,"outputs":[{"output_type":"stream","text":"= 1\n","name":"stdout"}]},{"metadata":{},"id":"d33c3db1","cell_type":"markdown","source":"# Last thin to know before performing the task: The position needed for action execution:"},{"metadata":{"trusted":true},"id":"889d1ea4","cell_type":"code","source":"positionquery = \"\"\"  SELECT ?position WHERE {\n      SERVICE <https://api.krr.triply.cc/datasets/mkumpel/FruitCuttingKG/services/FoodCuttingKG/sparql> {  \n  OPTIONAL { %s rdfs:subClassOf ?sub.}\n  ?sub rdfs:subClassOf* ?node.\n  ?node owl:onProperty cut:affordsPosition.\n  ?node owl:someValuesFrom ?position.\n} }\"\"\" % (task)\n\nfor row in g.query(positionquery):\n    print(row.position)","execution_count":19,"outputs":[{"output_type":"stream","text":"http://www.ease-crc.org/ont/food_cutting#halving_position\n","name":"stdout"}]},{"metadata":{"trusted":false},"id":"007b937a","cell_type":"code","source":"","execution_count":null,"outputs":[]}],"metadata":{"kernelspec":{"name":"python3","display_name":"Python 3 (ipykernel)","language":"python"},"language_info":{"name":"python","version":"3.10.6","mimetype":"text/x-python","codemirror_mode":{"name":"ipython","version":3},"pygments_lexer":"ipython3","nbconvert_exporter":"python","file_extension":".py"}},"nbformat":4,"nbformat_minor":5}